Repository: Kun686/iTerm2-CN
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: When a terminal session is linked to this chat, the AI may view terminal contents and run commands in that session. You will be prompted to grant permission before it is able to view, type to, or modify a terminal session.
zh_hans: 终端会话链接到此聊天后，AI 可能查看终端内容并在该会话中运行命令。在 AI 能够查看、输入或修改终端会话前，系统会提示您授予权限。

# ui.swift.aiterm.chatviewcontroller.workgroup.27dd7346
source: workgroup
zh_hans: 工作组

source: Would you like to grant AI **%1$@** permission?
zh_hans: 要授予 AI **%1$@** 权限吗？

source: You can use these buttons or the info button menu at the top of the chat window to control AI permissions for this chat.
zh_hans: 您可以使用这些按钮或聊天窗口顶部的信息按钮菜单来控制此聊天的 AI 权限。

# ui.swift.aiterm.chatwindowcontroller.ai_chat.fe98f42c
source: AI Chat
zh_hans: AI 聊天

source: AI Chat could not open because of a problem loading the database. Verify there is only one instance of iTerm2 running.
zh_hans: 由于加载数据库时出现问题，无法打开 AI 聊天。请确认只运行了一个 iTerm2 实例。

# ui.swift.aiterm.chatwindowcontroller.ai_model.160ed06f
source: AI Model
zh_hans: AI 模型

# ui.swift.aiterm.chatwindowcontroller.ai_provider.84e1ec2c
source: AI Provider
zh_hans: AI 提供商

# ui.swift.aiterm.chatwindowcontroller.ai_speed.855afa00
source: AI Speed
zh_hans: AI 速度

# ui.swift.aiterm.chatwindowcontroller.are_you_sure_you_want_to_delete_0.bf23d5ee
source: Are you sure you want to delete %1$lld chats? This action cannot be undone.
zh_hans: 确定要删除这 %1$lld 个聊天吗？此操作无法撤销。

source: Are you sure you want to delete this chat? This action cannot be undone.
zh_hans: 确定要删除此聊天吗？此操作无法撤销。

# ui.swift.aiterm.chatwindowcontroller.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.swift.aiterm.chatwindowcontroller.chat_about_0.713b508a
source: Chat about %1$@
zh_hans: 关于“%1$@”的聊天

# ui.swift.aiterm.chatwindowcontroller.choose_a_new_name_for_this_chat.a5b8a805
source: Choose a new name for this chat.
zh_hans: 为此聊天选择新名称。

# ui.swift.aiterm.chatwindowcontroller.delete.e2d0a549
source: Delete
zh_hans: 删除

# ui.swift.aiterm.chatwindowcontroller.delete_0_chats.09c1b26b
source: Delete %1$lld Chats?
zh_hans: 删除 %1$lld 个聊天？

# ui.swift.aiterm.chatwindowcontroller.delete_chat.b4973d03
source: Delete Chat?
zh_hans: 删除聊天？

# ui.swift.aiterm.chatwindowcontroller.effort.4387e5d3
source: Effort
zh_hans: 强度

source: Enable or disable thinking/reasoning mode
zh_hans: 启用或禁用思考/推理模式

# ui.swift.aiterm.chatwindowcontroller.enable_or_disable_web_search.7661c544
source: Enable or disable web search
zh_hans: 启用或禁用网页搜索

# ui.swift.aiterm.chatwindowcontroller.error.54a0e8c1
source: Error
zh_hans: 错误

source: Link or unlink terminal/browser session
zh_hans: 链接或取消链接终端/浏览器会话

# ui.swift.aiterm.chatwindowcontroller.link_session.8ff6f7ae
source: Link Session
zh_hans: 链接会话

# ui.swift.aiterm.chatwindowcontroller.model.5e2c614c
source: Model
zh_hans: 模型

# ui.swift.aiterm.chatwindowcontroller.new_chat.0d332351
source: New Chat
zh_hans: 新聊天

# ui.swift.aiterm.chatwindowcontroller.ok.565339bc
source: OK
zh_hans: 好

# ui.swift.aiterm.chatwindowcontroller.provider.472590ae
source: Provider
zh_hans: 提供商

# ui.swift.aiterm.chatwindowcontroller.reasoning_effort.6f71800c
source: Reasoning Effort
zh_hans: 推理强度

# ui.swift.aiterm.chatwindowcontroller.rename.3064d79a
source: Rename
zh_hans: 重命名

# ui.swift.aiterm.chatwindowcontroller.rename_chat.a257dec8
source: Rename Chat
zh_hans: 重命名聊天

# ui.swift.aiterm.chatwindowcontroller.rename_failed.b89e58be
source: Rename Failed
zh_hans: 重命名失败

# ui.swift.aiterm.chatwindowcontroller.select_ai_model.5f1bd2d0
source: Select AI model
zh_hans: 选择 AI 模型

# ui.swift.aiterm.chatwindowcontroller.select_ai_provider_for_new_chats.934d3a2f
source: Select AI provider for new chats
zh_hans: 为新聊天选择 AI 提供商

# ui.swift.aiterm.chatwindowcontroller.select_ai_service_tier.97ddf1f1
source: Select AI service tier
zh_hans: 选择 AI 服务等级

# ui.swift.aiterm.chatwindowcontroller.select_reasoning_effort.0fe66e8c
source: Select reasoning effort
zh_hans: 选择推理强度

# ui.swift.aiterm.chatwindowcontroller.session.6959b415
source: Session
zh_hans: 会话

# ui.swift.aiterm.chatwindowcontroller.show_or_hide_the_chat_list.2f53dce5
source: Show or hide the chat list
zh_hans: 显示或隐藏聊天列表

# ui.swift.aiterm.chatwindowcontroller.speed.c372fee9
source: Speed
zh_hans: 速度

# ui.swift.aiterm.chatwindowcontroller.the_chat_could_not_be_renamed.f5548bc0
source: The chat could not be renamed.
zh_hans: 无法重命名此聊天。

source: The messages for this chat could not be loaded.
zh_hans: 无法加载此聊天的消息。

source: There was a problem initializing the database
zh_hans: 初始化数据库时出现问题

# ui.swift.aiterm.chatwindowcontroller.thinking.a20d12c5
source: Thinking
zh_hans: 思考

# ui.swift.aiterm.chatwindowcontroller.toggle_chat_list.1b57d229
source: Toggle Chat List
zh_hans: 切换聊天列表

# ui.swift.aiterm.chatwindowcontroller.toggle_thinking.6de16e19
source: Toggle Thinking
zh_hans: 切换思考模式

# ui.swift.aiterm.chatwindowcontroller.toggle_web_search.10289a0d
source: Toggle Web Search
zh_hans: 切换网页搜索

# ui.swift.aiterm.chatwindowcontroller.web_search.d04fc7d7
source: Web Search
zh_hans: 网页搜索

# ui.swift.aiterm.datecellview.invalid_date.cd63c7df
source: Invalid date
zh_hans: 日期无效

# ui.swift.aiterm.datecellview.today.2b065c7c
source: Today
zh_hans: 今天

# ui.swift.aiterm.datecellview.yesterday.56618125
source: Yesterday
zh_hans: 昨天

# ui.swift.aiterm.fileattachmentsubpartview.open.ed077f3d
source: Open
zh_hans: 打开

# ui.swift.aiterm.fileattachmentsubpartview.reveal_in_finder.cc849385
source: Reveal in Finder
zh_hans: 在 Finder 中显示

# ui.swift.aiterm.inlinechattoolbarview.ai_chat.fe98f42c
source: AI Chat
zh_hans: AI 聊天

# ui.swift.aiterm.inlinechattoolbarview.hide_chat.1ed9f9bf
source: Hide chat
zh_hans: 隐藏聊天

# ui.swift.aiterm.inlinechattoolbarview.new_chat.db18382a
source: New chat
zh_hans: 新建聊天

# ui.swift.aiterm.inlinechattoolbarview.switch_to_another_chat.e76a6db8
source: Switch to another chat
zh_hans: 切换到其他聊天

# ui.swift.aiterm.itermaitermgatekeeper.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.swift.aiterm.itermaitermgatekeeper.feature_unavailable.5031e0f3
source: Feature Unavailable
zh_hans: 功能不可用

source: Generative AI features have been disabled. Check with your system administrator.
zh_hans: 生成式 AI 功能已被禁用。请联系系统管理员。

# ui.swift.aiterm.itermaitermgatekeeper.ok.565339bc
source: OK
zh_hans: 好

# ui.swift.aiterm.itermaitermgatekeeper.plugin_missing.5c735ad6
source: Plugin Missing
zh_hans: 缺少插件

# ui.swift.aiterm.itermaitermgatekeeper.reveal.36b830bd
source: Reveal
zh_hans: 显示

# ui.swift.aiterm.itermaitermgatekeeper.reveal_in_settings.21379104
source: Reveal in Settings
zh_hans: 在设置中显示

source: You must enable AI features in settings before you can use this feature.
zh_hans: 必须先在设置中启用 AI 功能，才能使用此功能。

source: You must install the AI plugin before you can use this feature.
zh_hans: 必须先安装 AI 插件，才能使用此功能。

# ui.swift.aiterm.llm.executing_code.b7a07877
source: Executing code…
zh_hans: 正在执行代码…

# ui.swift.aiterm.llm.finished_executing_code.cef8e474
source: Finished executing code
zh_hans: 代码执行完毕

# ui.swift.aiterm.llm.finished_searching_the_web.4a14a066
source: Finished searching the web.
zh_hans: 网页搜索已完成。

# ui.swift.aiterm.llm.finished_searching_the_web_for_0.40841c3c
source: Finished searching the web for %1$@.
zh_hans: 已完成关于%1$@的网页搜索。

# ui.swift.aiterm.llm.searching_the_web.f1acf3c9
source: Searching the web…
zh_hans: 正在搜索网页…

# ui.swift.aiterm.llmprovider.unknown_platform.9c60e933
source: Unknown Platform
zh_hans: 未知平台

# ui.swift.aiterm.markdownhelpers.copied.8d525e5f
source: Copied
zh_hans: 已复制

# ui.swift.aiterm.markdownhelpers.copy.e21f935f
source: Copy
zh_hans: 复制

# ui.swift.aiterm.markdownhelpers.executing_code.b7a07877
source: Executing code…
zh_hans: 正在执行代码…

# ui.swift.aiterm.markdownhelpers.finished_executing_code.cef8e474
source: Finished executing code
zh_hans: 代码执行完毕

# ui.swift.aiterm.markdownhelpers.finished_searching_the_web.4a14a066
source: Finished searching the web.
zh_hans: 网页搜索完成。

# ui.swift.aiterm.markdownhelpers.finished_searching_the_web_for_0.8fb9c1c7
source: Finished searching the web for **%1$@**.
zh_hans: 已完成对 **%1$@** 的网页搜索。

# ui.swift.aiterm.markdownhelpers.searching_the_web.f1acf3c9
source: Searching the web…
zh_hans: 正在搜索网页…

# ui.swift.aiterm.message.empty_message.79791f17
source: Empty message
zh_hans: 空消息

# ui.swift.aiterm.message.finished_executing_command.9cb4300a
source: Finished executing command
zh_hans: 命令执行完毕

# ui.swift.aiterm.message.ran_0.b966d3e6
source: Ran `%1$@`
zh_hans: 已运行 `%1$@`

# ui.swift.aiterm.message.selecting_session.a7caea89
source: Selecting session…
zh_hans: 正在选择会话…

# ui.swift.aiterm.message.sending_commands_to_ai_automatically.6364d19b
source: Sending commands to AI automatically
zh_hans: 正在自动向 AI 发送命令

# ui.swift.aiterm.message.stopped_sending_commands_to_ai.af56ab25
source: Stopped sending commands to AI
zh_hans: 已停止向 AI 发送命令

# ui.swift.aiterm.messagecellview.context_menu.36d75142
source: Context Menu
zh_hans: 上下文菜单

# ui.swift.aiterm.messagecellview.copy.e21f935f
source: Copy
zh_hans: 拷贝

# ui.swift.aiterm.messagecellview.delete.e2d0a549
source: Delete
zh_hans: 删除

# ui.swift.aiterm.messagecellview.edit.464c4ffd
source: Edit
zh_hans: 编辑

# ui.swift.aiterm.messagecellview.fork.8e5b1a73
source: Fork
zh_hans: 分叉

# ui.swift.aiterm.messagepreppipeline.failed_to_upload_0_1.7396273b
source: Failed to upload %1$@: %2$@
zh_hans: 无法上传 %1$@：%2$@

source: There was a problem adding files to the vector store: %1$@
zh_hans: 将文件添加到向量存储时出现问题：%1$@

source: There was a problem creating a vector store database: %1$@
zh_hans: 创建向量存储数据库时出现问题：%1$@

# ui.swift.aiterm.messagepreppipeline.upload_of_0_finished.fa56abc9
source: Upload of %1$@ finished.
zh_hans: %1$@ 上传完成。

# ui.swift.aiterm.messagepreppipeline.uploading.5ce44dd7
source: Uploading…
zh_hans: 正在上传…

# ui.swift.aiterm.multipartmessagecellview.code_interpreter.730d8133
source: Code Interpreter
zh_hans: 代码解释器

# ui.swift.aiterm.multipartmessagecellview.copy.e21f935f
source: Copy
zh_hans: 拷贝

# ui.swift.aiterm.remotecommand.act_in_web_browser.b7b20534
source: Act in Web Browser
zh_hans: 操作网页浏览器

# ui.swift.aiterm.remotecommand.ai_can_act_in_web_browser
source: AI can Act in Web Browser
zh_hans: AI 可以操作网页浏览器

# ui.swift.aiterm.remotecommand.ai_can_check_terminal_state
source: AI can Check Terminal State
zh_hans: AI 可以检查终端状态

# ui.swift.aiterm.remotecommand.ai_can_control_terminal
source: AI can Control Terminal
zh_hans: AI 可以控制终端

# ui.swift.aiterm.remotecommand.ai_can_run_commands
source: AI can Run Commands
zh_hans: AI 可以运行命令

# ui.swift.aiterm.remotecommand.ai_can_view_contents
source: AI can View Contents
zh_hans: AI 可以查看内容

# ui.swift.aiterm.remotecommand.ai_can_view_manpages
source: AI can View Manpages
zh_hans: AI 可以查看手册页

# ui.swift.aiterm.remotecommand.ai_can_write_to_clipboard
source: AI can Write to the Clipboard
zh_hans: AI 可以写入剪贴板

# ui.swift.aiterm.remotecommand.ai_can_write_to_filesystem
source: AI can Write to the File System
zh_hans: AI 可以写入文件系统

source: By setting this permission to “Always Allow”, terminal state will be sent automatically on every message you send in this chat. This includes: • The current or last command and its exit status •The window size • Your shell • The current working directory, username, and hostname.
zh_hans: 将此权限设为“始终允许”后，每次您在此聊天中发送消息时，都会自动发送终端状态。 其中包括： • 当前或上一条命令及其退出状态 • 窗口大小 • 您使用的 Shell • 当前工作目录、用户名和主机名。

source: By setting this permission to “Always Allow”, the current visible screen of your terminal session will be sent automatically on every message you send in this chat.
zh_hans: 将此权限设为“始终允许”后，每次您在此聊天中发送消息时，都会自动发送终端会话当前可见的屏幕内容。

# ui.swift.aiterm.remotecommand.check_terminal_state.71aeb145
source: Check Terminal State
zh_hans: 检查终端状态

# ui.swift.aiterm.remotecommand.checking_if_you_are_using_ssh.40f27888
source: Checking if you are using SSH
zh_hans: 正在检查是否正在使用 SSH

# ui.swift.aiterm.remotecommand.checking_if_you_re_at_a_shell_prompt.63c128fa
source: Checking if you're at a shell prompt
zh_hans: 正在检查是否位于 Shell 提示符

source: Checking the exit status of the last command
zh_hans: 正在检查上一条命令的退出状态

# ui.swift.aiterm.remotecommand.checking_the_manpage_for_0.cf6372e2
source: Checking the manpage for `%1$@`
zh_hans: 正在查看 `%1$@` 的手册页

# ui.swift.aiterm.remotecommand.checking_your_username.7b59dcf0
source: Checking your username
zh_hans: 正在检查您的用户名

# ui.swift.aiterm.remotecommand.control_terminal.ce3629c0
source: Control Terminal
zh_hans: 控制终端

# ui.swift.aiterm.remotecommand.creating_0.e86a9dc7
source: Creating %1$@
zh_hans: 正在创建 %1$@

# ui.swift.aiterm.remotecommand.determining_which_shell_you_use.f866a6fa
source: Determining which shell you use
zh_hans: 正在确定您使用的 Shell

# ui.swift.aiterm.remotecommand.discovering_your_current_directory.17a96e5b
source: Discovering your current directory
zh_hans: 正在确定当前目录

# ui.swift.aiterm.remotecommand.erasing_the_current_command_line.a0452212
source: Erasing the current command line
zh_hans: 正在清除当前命令行

# ui.swift.aiterm.remotecommand.executing_0.55882296
source: Executing `%1$@`
zh_hans: 正在执行 `%1$@`

source: Fetching the output of a previously run command
zh_hans: 正在获取先前运行命令的输出

# ui.swift.aiterm.remotecommand.get_the_current_url.f820440f
source: Get the current URL
zh_hans: 正在获取当前 URL

source: Getting the current host name of this terminal session
zh_hans: 正在获取此终端会话的当前主机名

# ui.swift.aiterm.remotecommand.navigate_to_0.ad407e9c
source: Navigate to %1$@
zh_hans: 正在前往 %1$@

# ui.swift.aiterm.remotecommand.pasting_to_the_clipboard.89c26b75
source: Pasting to the clipboard
zh_hans: 正在粘贴到剪贴板

# ui.swift.aiterm.remotecommand.provide_screen_contents_automatically.6698aebf
source: Provide Screen Contents Automatically
zh_hans: 自动提供屏幕内容

# ui.swift.aiterm.remotecommand.provide_terminal_state_automatically.432955e8
source: Provide Terminal State Automatically
zh_hans: 自动提供终端状态

# ui.swift.aiterm.remotecommand.querying_the_size_of_your_terminal_window.cb20c42e
source: Querying the size of your terminal window
zh_hans: 正在查询终端窗口大小

# ui.swift.aiterm.remotecommand.reading_the_visible_screen.a7ff13e6
source: Reading the visible screen
zh_hans: 正在读取可见屏幕

# ui.swift.aiterm.remotecommand.reading_your_current_command_prompt.68cd605a
source: Reading your current command prompt
zh_hans: 正在读取当前命令提示符

# ui.swift.aiterm.remotecommand.restarting_this_session.4cef6688
source: Restarting this session
zh_hans: 正在重新启动此会话

source: Reviewing the history of commands you have run in this session
zh_hans: 正在查看您在此会话中运行过的命令历史

# ui.swift.aiterm.remotecommand.run_commands.19f26589
source: Run Commands
zh_hans: 运行命令

# ui.swift.aiterm.remotecommand.search_in_browser_for_0.4337dcac
source: Search in browser for %1$@
zh_hans: 正在浏览器中搜索 %1$@

# ui.swift.aiterm.remotecommand.search_the_web_for_0.6583f7f4
source: Search the web for “%1$@”
zh_hans: 正在搜索网页：“%1$@”

source: Searching the history of commands you have run in this session
zh_hans: 正在搜索您在此会话中运行过的命令历史

# ui.swift.aiterm.remotecommand.the_ai_agent_would_like_to_check_if.00451475
source: The AI Agent would like to check if you are using SSH
zh_hans: AI 代理想要检查您是否正在使用 SSH

# ui.swift.aiterm.remotecommand.the_ai_agent_would_like_to_check_if.96cffa24
source: The AI Agent would like to check if you're at a shell prompt
zh_hans: AI 代理想要检查您是否位于 Shell 提示符

# ui.swift.aiterm.remotecommand.the_ai_agent_would_like_to_check_the.9c790e3b
source: The AI Agent would like to check the exit status of the last command
zh_hans: AI 代理想要检查上一条命令的退出状态

# ui.swift.aiterm.remotecommand.the_ai_agent_would_like_to_check_the.fd92d4b8
source: The AI Agent would like to check the manpage for `%1$@`
zh_hans: AI 代理想要查看 `%1$@` 的手册页

# ui.swift.aiterm.remotecommand.the_ai_agent_would_like_to_check_your.6b6c54f1
source: The AI Agent would like to check your username
zh_hans: AI 代理想要检查您的用户名

# ui.swift.aiterm.remotecommand.the_ai_agent_would_like_to_create_a.7bb1119e
source: The AI Agent would like to create a file named `%1$@`
zh_hans: AI 代理想要创建名为 `%1$@` 的文件

source: The AI Agent would like to determine which shell you use
zh_hans: AI 代理想要确定您使用的 Shell

# ui.swift.aiterm.remotecommand.the_ai_agent_would_like_to_erase_the.46751a8e
source: The AI Agent would like to erase the current command line
zh_hans: AI 代理想要清除当前命令行

# ui.swift.aiterm.remotecommand.the_ai_agent_would_like_to_execute_0.b31faa87
source: The AI Agent would like to execute `%1$@`
zh_hans: AI 代理想要执行 `%1$@`

# ui.swift.aiterm.remotecommand.the_ai_agent_would_like_to_fetch_the.5c04f44b
source: The AI Agent would like to fetch the output of a previously run command
zh_hans: AI 代理想要获取先前运行命令的输出

# ui.swift.aiterm.remotecommand.the_ai_agent_would_like_to_get_the.bb6396a8
source: The AI Agent would like to get the current host name of this terminal session
zh_hans: AI 代理想要获取此终端会话的当前主机名

# ui.swift.aiterm.remotecommand.the_ai_agent_would_like_to_know_your.a6a231ca
source: The AI Agent would like to know your current directory
zh_hans: AI 代理想要了解您的当前目录

# ui.swift.aiterm.remotecommand.the_ai_agent_would_like_to_navigate_to.21b53e83
source: The AI agent would like to navigate to %1$@
zh_hans: AI 代理想要前往 %1$@

# ui.swift.aiterm.remotecommand.the_ai_agent_would_like_to_paste_to.c6f6c27d
source: The AI Agent would like to paste to the clipboard
zh_hans: AI 代理想要写入剪贴板

# ui.swift.aiterm.remotecommand.the_ai_agent_would_like_to_query_the.a9731890
source: The AI Agent would like to query the size of your terminal window
zh_hans: AI 代理想要查询终端窗口大小

# ui.swift.aiterm.remotecommand.the_ai_agent_would_like_to_read_the.6d277182
source: The AI Agent would like to read the visible screen of your terminal session
zh_hans: AI 代理想要读取终端会话的可见屏幕

# ui.swift.aiterm.remotecommand.the_ai_agent_would_like_to_read_your.f24141bf
source: The AI Agent would like to read your current command prompt
zh_hans: AI 代理想要读取当前命令提示符

# ui.swift.aiterm.remotecommand.the_ai_agent_would_like_to_restart_this.e0d6447d
source: The AI Agent would like to restart this session, which kills any running jobs
zh_hans: AI 代理想要重新启动此会话；这会终止所有正在运行的作业

# ui.swift.aiterm.remotecommand.the_ai_agent_would_like_to_review_the.d7e7bd06
source: The AI Agent would like to review the history of commands you have run in this session
zh_hans: AI 代理想要查看您在此会话中运行过的命令历史

# ui.swift.aiterm.remotecommand.the_ai_agent_would_like_to_search_the.29e118d1
source: The AI agent would like to search the current web page for “%1$@”
zh_hans: AI 代理想要在当前网页中搜索“%1$@”

# ui.swift.aiterm.remotecommand.the_ai_agent_would_like_to_search_the.b992d96c
source: The AI Agent would like to search the history of commands you have run in this session
zh_hans: AI 代理想要搜索您在此会话中运行过的命令历史

# ui.swift.aiterm.remotecommand.the_ai_agent_would_like_to_type_0.b541acec
source: The AI Agent would like to type `%1$@` into the current session
zh_hans: AI 代理想要在当前会话中输入 `%1$@`

# ui.swift.aiterm.remotecommand.the_ai_agent_would_like_to_view_the.f02520c1
source: The AI Agent would like to view the last command you ran in this session
zh_hans: AI 代理想要查看您在此会话中运行的上一条命令

# ui.swift.aiterm.remotecommand.the_ai_agent_would_like_to_write_to.442ecdf4
source: The AI agent would like to write to search the web for “%1$@”
zh_hans: AI 代理想要搜索网页：“%1$@”

# ui.swift.aiterm.remotecommand.the_ai_agent_would_like_to_write_to.910b1970
source: The AI agent would like to write to view the current web page
zh_hans: AI 代理想要查看当前网页

# ui.swift.aiterm.remotecommand.the_ai_agent_would_like_to_write_to.b046fb29
source: The AI agent would like to write to get the current URL
zh_hans: AI 代理想要获取当前 URL

# ui.swift.aiterm.remotecommand.typing_0_into_the_current_session.49827839
source: Typing `%1$@` into the current session
zh_hans: 正在当前会话中输入 `%1$@`

# ui.swift.aiterm.remotecommand.view_contents.e71a1882
source: View Contents
zh_hans: 查看内容

# ui.swift.aiterm.remotecommand.view_manpages.347c2b56
source: View Manpages
zh_hans: 查看手册页

# ui.swift.aiterm.remotecommand.view_the_current_web_page.cd69b1fb
source: View the current web page
zh_hans: 正在查看当前网页

# ui.swift.aiterm.remotecommand.viewing_the_last_command_you_ran_in_this.55ac3d8b
source: Viewing the last command you ran in this session
zh_hans: 正在查看您在此会话中运行的上一条命令

# ui.swift.aiterm.remotecommand.write_to_the_clipboard.57ebfebe
source: Write to the Clipboard
zh_hans: 写入剪贴板

# ui.swift.aiterm.remotecommand.write_to_the_file_system.0e9e5390
source: Write to the File System
zh_hans: 写入文件系统

# ui.swift.aiterm.remotecommand_mac.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.swift.aiterm.remotecommand_mac.command_safety_checking_has_changed.5515379b
source: Command Safety Checking Has Changed
zh_hans: 命令安全检查已更改

# ui.swift.aiterm.remotecommand_mac.enable_command_safety_checking.746e910c
source: Enable Command Safety Checking?
zh_hans: 启用命令安全检查？

# ui.swift.aiterm.remotecommand_mac.iterm2_can_use_ai_to_check_the_safety.2c521501
source: iTerm2 can use AI to check the safety of commands suggested by your AI agent. Would you like to enable safety checking? When enabled, each proposed command will be sent to your configured AI provider for a safety check.
zh_hans: iTerm2 可以使用 AI 检查 AI 代理所建议命令的安全性。要启用安全检查吗？ 启用后，每条建议的命令都会发送给您配置的 AI 提供商进行安全检查。

# ui.swift.aiterm.remotecommand_mac.keep_apple_intelligence.18a05b96
source: Keep Apple Intelligence
zh_hans: 保留 Apple 智能

# ui.swift.aiterm.remotecommand_mac.ok.565339bc
source: OK
zh_hans: 好

# ui.swift.aiterm.remotecommand_mac.switch_to_my_model.c2a3ad63
source: Switch to My Model
zh_hans: 切换到我的模型

source: Until now, iTerm2 checked the safety of AI-suggested commands on your Mac using Apple Intelligence, at no cost. It can now use your configured AI model instead, which is more accurate but sends each checked command to your AI provider and may incur charges. Switch to your configured model? If you decline, iTerm2 keeps using Apple Intelligence.
zh_hans: 此前，iTerm2 一直使用 Mac 上的 Apple 智能免费检查 AI 建议命令的安全性。现在可以改用您配置的 AI 模型，结果更准确，但会将每条受检查的命令发送给 AI 提供商，并可能产生费用。 要切换到您配置的模型吗？如果拒绝，iTerm2 将继续使用 Apple 智能。

# ui.swift.aiterm.terminalcommandmessagecellview.command_icon.0d8b3f07
source: Command icon
zh_hans: 命令图标

# ui.swift.api.itermscriptruntime.check_for_updated_runtime.3c2bbc24
source: Check for Updated Runtime
zh_hans: 检查运行时更新

# ui.swift.api.itermscriptruntime.install_python_runtime.e231a60b
source: Install Python Runtime
zh_hans: 安装 Python 运行时

source: Some scripts were written for Python versions that are no longer available and now use newer ones. Python versions are not always compatible across releases, so a bumped script may need small changes. %1$@
zh_hans: 部分脚本原本使用的 Python 版本已不可用，因此现在改用较新版本。不同版本的 Python 并不总是兼容，因此升级版本后的脚本可能需要少量修改。 %1$@

source: The script “%1$@” was written for Python %2$@, which is no longer available, so it now uses Python %3$@. Python versions are not always compatible across releases, so a bumped script may need small changes.
zh_hans: 脚本“%1$@”原本为 Python %2$@ 编写，但该版本已不可用，因此现在改用 Python %3$@。不同版本的 Python 并不总是兼容，因此升级版本后的脚本可能需要少量修改。

# ui.swift.api.itermuvprovisioner.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.swift.api.itermuvprovisioner.download_python_support.7b01f018
source: Download Python Support?
zh_hans: 下载 Python 支持？

# ui.swift.api.itermuvprovisioner.downloading_uv.cc5d76da
source: Downloading uv…
zh_hans: 正在下载 uv…

# ui.swift.api.itermuvprovisioner.ok.565339bc
source: OK
zh_hans: 好

source: To run Python scripts, iTerm2 needs to download uv (about %1$lld MB) and a Python interpreter. Additional Python versions are downloaded automatically later if a script needs them. OK to download it now?
zh_hans: 要运行 Python 脚本，iTerm2 需要下载 uv（约 %1$lld MB）和一个 Python 解释器。如果脚本以后需要其他 Python 版本，系统会自动下载。现在下载吗？

# ui.swift.appkit.commandurlhandler.as_0.b2ab4ed2
source: as %1$@
zh_hans: 以 %1$@ 身份

# ui.swift.appkit.commandurlhandler.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.swift.appkit.commandurlhandler.command.a7a9c915
source: Command:
zh_hans: 命令：

# ui.swift.appkit.commandurlhandler.directory.8b948460
source: Directory:
zh_hans: 目录：

# ui.swift.appkit.commandurlhandler.directory.c8f84c3c
source: Directory
zh_hans: 目录
